import Header from "@/componetnts/aboutus/header";
import ServicesItem from "@/componetnts/services/services"
import AOS from 'aos';
import 'aos/dist/aos.css';
import { useEffect } from "react";

function Services() {
    useEffect(() => {
        // راه‌اندازی AOS
        AOS.init({
            duration: 1000, // مدت زمان انیمیشن
            once: true, // آیا انیمیشن فقط یک بار اجرا شود؟
        });
    }, []);
    const arr = [
        {id : 1 , dir: "rtl", img: "https://raw.githubusercontent.com/sobhansefidkar/vandad-images/refs/heads/main/images/services/banner1.webp", text: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد کتابهای زیادی در شصت و سه درصد گذشته حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد", list: ["ایتم اول", "ایتم دوم", "ایتم سوم", "ایتم چهارم", "ایتم پنجم",] },
        {id : 2 , dir: "ltr", img: "https://raw.githubusercontent.com/sobhansefidkar/vandad-images/refs/heads/main/images/services/banner2.webp", text: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد کتابهای زیادی در شصت و سه درصد گذشته حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد", list: ["ایتم اول", "ایتم دوم", "ایتم سوم", "ایتم چهارم", "ایتم پنجم",] },
        {id : 3 , dir: "rtl", img: "https://raw.githubusercontent.com/sobhansefidkar/vandad-images/refs/heads/main/images/services/banner3.webp", text: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد کتابهای زیادی در شصت و سه درصد گذشته حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد", list: ["ایتم اول", "ایتم دوم", "ایتم سوم", "ایتم چهارم", "ایتم پنجم",] },
        {id : 4 , dir: "ltr", img: "https://raw.githubusercontent.com/sobhansefidkar/vandad-images/refs/heads/main/images/services/banner4.webp", text: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد کتابهای زیادی در شصت و سه درصد گذشته حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد", list: ["ایتم اول", "ایتم دوم", "ایتم سوم", "ایتم چهارم", "ایتم پنجم",] },
        {id : 5 , dir: "rtl", img: "https://raw.githubusercontent.com/sobhansefidkar/vandad-images/refs/heads/main/images/services/banner5.webp", text: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد کتابهای زیادی در شصت و سه درصد گذشته حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد", list: ["ایتم اول", "ایتم دوم", "ایتم سوم", "ایتم چهارم", "ایتم پنجم",] },
        {id : 6 , dir: "ltr", img: "https://raw.githubusercontent.com/sobhansefidkar/vandad-images/refs/heads/main/images/services/banner6.webp", text: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد کتابهای زیادی در شصت و سه درصد گذشته حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد", list: ["ایتم اول", "ایتم دوم", "ایتم سوم", "ایتم چهارم", "ایتم پنجم",] },
        {id : 7 , dir: "rtl", img: "https://raw.githubusercontent.com/sobhansefidkar/vandad-images/refs/heads/main/images/services/banner7.webp", text: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد کتابهای زیادی در شصت و سه درصد گذشته حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد", list: ["ایتم اول", "ایتم دوم", "ایتم سوم", "ایتم چهارم", "ایتم پنجم",] },
        {id : 8 , dir: "ltr", img: "https://raw.githubusercontent.com/sobhansefidkar/vandad-images/refs/heads/main/images/services/banner8.webp", text: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد کتابهای زیادی در شصت و سه درصد گذشته حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد", list: ["ایتم اول", "ایتم دوم", "ایتم سوم", "ایتم چهارم", "ایتم پنجم",] },
        {id : 9 , dir: "rtl", img: "https://raw.githubusercontent.com/sobhansefidkar/vandad-images/refs/heads/main/images/services/banner9.webp", text: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد کتابهای زیادی در شصت و سه درصد گذشته حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد", list: ["ایتم اول", "ایتم دوم", "ایتم سوم", "ایتم چهارم", "ایتم پنجم",] },
        {id : 10 , dir: "ltr", img: "https://raw.githubusercontent.com/sobhansefidkar/vandad-images/refs/heads/main/images/services/banner10.webp", text: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد کتابهای زیادی در شصت و سه درصد گذشته حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد", list: ["ایتم اول", "ایتم دوم", "ایتم سوم", "ایتم چهارم", "ایتم پنجم",] },
    ]
    return (
        <div className=" w-[100vw] flex flex-col items-center">
            <Header/>
            {
                arr.map((item, i) => {
                    return (
                        <ServicesItem key={i} img={item.img} text={item.text} list={item.list} dir={item.dir} id={item.id}/>
                    )
                })
            }
        </div>
    );
}

export default Services;